# General-purpose data compression with high compression ratio
brew "xz"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# GitHub command-line tool
brew "gh"
# Go version management
brew "goenv"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Manage multiple Node.js versions
brew "nvm"
# Object-relational database system
brew "postgresql@18"
# Python version management
brew "pyenv"
# User interface to the TELNET protocol
brew "telnet"
# General-purpose lossless data-compression library
brew "zlib"
# App to build and share containerised applications and microservices
cask "docker-desktop"
